{
  "language-selector.languages.vi": "Tiếng Việt",
  "language-selector.languages.en": "Tiếng Anh",
  "nav": {
    "home": "Trang chủ",
    "about": "Về tôi",
    "blog": "Blog",
    "contact": "Liên hệ",
    "resume": "Tóm tắt",
    "service": "Dịch vụ",
    "tools": "Công cụ"
  },
  "about": {
    "title": "Về tôi",
    "ecommerce": "Thương mại điện tử",
    "development": "Lập trình viên",
    "design": "Thiết kế",
    "my-bio": "Tiểu sử của tôi",
    "hire-me": "Hợp tác cùng tôi",
    "download-cv": "Tải xuống CV",
    "meta": {
      "description": "Tìm hiểu thêm về Nguyễn Công Minh, lập trình viên fullstack với kinh nghiệm trong phát triển web, thiết kế và chuyển đổi số.",
      "keywords": "về tôi, tiểu sử, lập trình viên fullstack, phát triển web, thiết kế"
    },
    "description": {
      "development": "Phát triển phần mềm theo yêu cầu của khách, dễ dàng, nhanh chóng, hiện đại sử dụng các loại ngôn ngữ phổ biến dễ dàng bảo trì phần mềm và phù hợp với thị trường",
      "design": "Thiết kế ảnh bìa, chỉnh sửa ảnh bìa, ảnh chân dung phong cảnh, chỉnh sửa video",
      "ecommerce": "Thương mại điện tử"
    },
    "my-summary": "Lập trình viên Fullstack với gần 3 năm kinh nghiệm trong việc thiết kế và phát triển các giải pháp front-end và back-end. Có kinh nghiệm trong chuyển đổi số, đặc biệt trong các lĩnh vực giáo dục, logistics và hoạt động kinh doanh. Thành thạo trong việc xây dựng các ứng dụng web có khả năng mở rộng, tích hợp API từ bên thứ ba, và tối ưu hóa hiệu suất cho các hệ thống phức tạp. Sử dụng thành thạo các framework Laravel và React, có kinh nghiệm quản lý cơ sở dữ liệu bằng MySQL và Firebase. Có kinh nghiệm làm việc với môi trường máy chủ, đặc biệt là Linux. Có khả năng hợp tác với các đội ngũ đa dạng để cung cấp các giải pháp phần mềm chất lượng cao, giúp nâng cao hiệu quả và đổi mới trong nhiều ngành công nghiệp.",
    "my-design": "Ngoài ra, tôi là một nhà thiết kế và biên tập viên và sử dụng khá thành thạo với phần mềm chỉnh sửa Adobe: Photoshop, Premier Pro và Illustrator"
  },
  "home": {
    "title": "Trang chủ",
    "introduction": "Tôi là Nguyễn Công Minh",
    "meta": {
      "description": "Portfolio cá nhân của Nguyễn Công Minh giới thiệu các kỹ năng, dự án và kinh nghiệm phát triển web.",
      "keywords": "portfolio, lập trình viên web, frontend, react, typescript"
    }
  },
  "error": {
    "403": "Xin lỗi, bạn không thể truy cập nội dung này",
    "404": "Xin lỗi, nội dung hoặc trang bạn truy cập không tồn tại",
    "500": "Đã có lỗi kỹ thuật",
    "other": "Không thể truy cập máy chủ, có thể lỗi kỹ thuật hoặc do vấn đề mạng của bạn"
  },
  "button": {
    "go-back-home": "Trở về trang chủ"
  },
  "service": {
    "title": "Dịch vụ",
    "necessary": "Cần thiết",
    "self-development": "Phát triển bản thân",
    "investment": "Đầu tư",
    "enjoys": "Thú vui cá nhân",
    "gifts": "Quà tặng",
    "your_salary": "Thu nhập của bạn",
    "meta": {
      "description": "Khám phá các dịch vụ được cung cấp bởi Nguyễn Công Minh bao gồm phát triển web, thiết kế và các giải pháp quản lý tài chính.",
      "keywords": "dịch vụ, phát triển web, thiết kế, quản lý tài chính"
    }
  },
  "resume": {
    "title": "Bản tóm tắt",
    "work-experience": "Kinh nghiệm làm việc",
    "education": "Học vấn",
    "meta": {
      "description": "Xem hồ sơ chuyên nghiệp, kinh nghiệm làm việc và quá trình học tập của Nguyễn Công Minh.",
      "keywords": "hồ sơ, CV, kinh nghiệm làm việc, học vấn, kỹ năng, sự nghiệp"
    }
  },
  "contact": {
    "title": "Liên hệ với tôi",
    "info": "Thông tin liên lạc",
    "first-name": "Tên",
    "last-name": "Họ",
    "email-address": "Địa chỉ email",
    "messenger": "Lời nhắn",
    "send-messenger": "Gửi tin nhắn",
    "meta": {
      "description": "Liên hệ với Nguyễn Công Minh. Thông tin liên lạc và biểu mẫu gửi tin nhắn có sẵn.",
      "keywords": "liên hệ, email, điện thoại, tin nhắn, kết nối"
    }
  },
  "footer": {
    "information": "Thông tin",
    "services": "Dịch vụ",
    "contact": "Liên hệ",
    "developer": "Được phát triển bởi Công Minh"
  },
  "sevice": {
    "savings": "Tiết kiệm"
  },
  "my_portfolio": {
    "title": "Portfolio của tôi"
  },
  "about_me": "Về tôi",
  "contact_me": "Liên hệ với tôi",
  "random-dice": "Xúc ngẫu nhiên",
  "small-result": "Nhỏ",
  "big-result": "Lớn",
  "lunar": {
    "your-lunar-year": "Năm sinh"
  },
  "tools": {
    "title": "Công cụ",
    "meta": {
      "description": "Khám phá các công cụ hữu ích được tạo bởi Nguyễn Công Minh bao gồm quản lý tài chính, máy tính âm lịch và trò chơi.",
      "keywords": "công cụ, tiện ích, quản lý tài chính, máy tính âm lịch, trò chơi"
    }
  }
}
